In [9]:
import pandas as pd
import sqlite3

In [11]:
df =pd.DataFrame({
    "ID": [1,2],
    "Name": ["Nohan", "Julian"]
})

In [12]:
df

   ID    Name
0   1   Nohan
1   2  Julian

In [14]:
conn = sqlite3.connect("demo.sqlite")

In [15]:
df.to_sql(name = "Demo", con = conn)

2

In [16]:
ls

Copy of exoplanets.xlsx  exodata.sql              output_file.sql
README.md                exoplanet_df.csv         project-3.sqlite
Untitled.ipynb           exoplanets.csv           starter-code.ipynb
data/                    flask api .ipynb
demo.sqlite              milky-way-map.jpg

In [17]:
pwd

'/Users/julianestrada/Desktop/Project-3'